# Manipulando estilo

In [1]:
import pandas as pd
import re

link_filme ="https://raw.githubusercontent.com/alura-cursos/introducao-a-data-science/master/aula4.2/movies.csv" 
filmes= pd.read_csv(link_filme)
filmes.columns=['ID_Filmes','Nome','Género']
filmes.head()

,ID_Filmes,Nome,Género
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [2]:
link_notas ='https://raw.githubusercontent.com/alura-cursos/introducao-a-data-science/master/aula4.1/ratings.csv'
notas = pd.read_csv(link_notas)
notas.columns = ['ID_Usuario','Filme','Nota','Data']
notas.head()

   ID_Usuario  Filme  Nota       Data
0           1      1   4.0  964982703
1           1      3   4.0  964981247
2           1      6   4.0  964982224
3           1     47   5.0  964983815
4           1     50   5.0  964982931

In [3]:
def color_red(val):
  color = 'red' if val<2 else 'black'
  return 'color: %s'% color

In [4]:
s=notas.head().style.applymap(color_red,subset=['ID_Usuario'])
s

In [5]:
def testes_nome(name):
  
  
  cor = 'red' if re.search(r'Toy Story[.]*', name)  else 'blue'
 
  return 'color:%s' % cor

In [6]:
n=filmes.head().style.applymap(testes_nome,subset=['Nome'])
n

In [7]:
from datetime import datetime
d1= datetime.now( )
valores = pd.DataFrame({'Data':['2019-09-24 13:06:18','2019-09-24 12:59:56',
'2019-09-24 13:04:44',
'2019-09-24 13:06:44',
'2019-09-24 13:05:15',
'2019-09-24 13:05:39',
'2019-09-24 13:06:23',
'2019-09-24 13:05:44',
'2019-09-24 13:02:17',
'2019-09-24 13:06:08',
'2019-09-24 13:05:14',
'2019-09-24 13:05:32',
'2019-09-24 13:06:27',
'2019-09-28 10:05:57'],
'Placa':['FCL-5195',
'GCN-2159',
'FNE-4788',
'FST-7136',
'FOM-1791',
'FBV-1459',
'FSR-8899',
'GCX-9849',
'GCU-1666',
'FPF-9246',
'FCE-3543',
'FPC-9995',
'GFS-8513',
'GCV-9512']})
valores.head()

                  Data     Placa
0  2019-09-24 13:06:18  FCL-5195
1  2019-09-24 12:59:56  GCN-2159
2  2019-09-24 13:04:44  FNE-4788
3  2019-09-24 13:06:44  FST-7136
4  2019-09-24 13:05:15  FOM-1791

## Background-color
>  Usa o mesmo metodo para coloca estilos na fontes utilizando o biblioteca **pandas** e função **style.applymap()** unica diferença que utilizamos o ***background-color*** no lugar de **color** 
>> *Conforme Exemplo abaixo*

In [8]:
def hora(data_hora):
  hora=datetime.strptime(data_hora,'%Y-%m-%d %H:%M:%S')
  com_hora=abs((datetime.today( )-hora).days)
  cor = 'red' if com_hora>=1 else 'green'
  return 'background-color : %s' % cor

In [9]:
s_valores =valores.style.applymap(hora,subset='Data')
s_valores

# Profiling

In [13]:
import pandas_profiling
pandas_profiling.ProfileReport(notas)
# sava em html isso depois

ModuleNotFoundError: No module named 'pandas_profiling'

## ProfileReport
> Criar um analise da estrutura do DataFrame, exibindo informções de colunas até tipo de dados realação entre a colunas

# Informações basica do dataframe

In [14]:
notas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100836 entries, 0 to 100835
Data columns (total 4 columns):
ID_Usuario    100836 non-null int64
Filme         100836 non-null int64
Nota          100836 non-null float64
Data          100836 non-null int64
dtypes: float64(1), int64(3)
memory usage: 3.1 MB

In [17]:
notas.index

RangeIndex(start=0, stop=100836, step=1)

> Metodo **info()** exibir a estrutura de inicio e fim mostrando sequência da ordem do index. Todas essas informações são baseadas no index e não na quantidade de item no dataframe. 

>> **Exemplo** O dataframe ***notas*** inicia seu index no 0, mas caso dataframe iniciasse no 1 e pulasse em dois em dois o indiice mostarias informações diferente conforme exemplo a baixo.

In [18]:
exemplo_info = pd.DataFrame({'Indice':[1,3,5,7],'nome':['lucas','eduarda','jose','maria'],'idade':[26,22,60,56],'sexo':['M','F','M','F']})
exemplo_info.set_index('Indice', inplace = True) # inplace altera o DataFrame raiz não é necessário armazenar e outra variavel
exemplo_info

           nome  idade sexo
Indice
1         lucas     26    M
3       eduarda     22    F
5          jose     60    M
7         maria     56    F

In [19]:
exemplo_info.index # Exibir a estrutura da coluna indice

Int64Index([1, 3, 5, 7], dtype='int64', name='Indice')

### ***Values*** Mostrar valores exibir o valores do DataFrame e forma de lista, mas sem o index

In [20]:
exemplo_info.values

array([['lucas', 26, 'M'],
       ['eduarda', 22, 'F'],
       ['jose', 60, 'M'],
       ['maria', 56, 'F']], dtype=object)

### ***Columns*** Mostra em formato de lista o rotulos da colunas sem o index

In [21]:
exemplo_info.columns

Index(['nome', 'idade', 'sexo'], dtype='object')

## Usando loc e Iloc

> O loc realizar a buscar baseado no indice definido da DataFrame.
>> Lembrando caso não seja passado nenhum indice python vai retorna um erro

### loc

In [22]:
exemplo_info.loc[[1,3,5]]

           nome  idade sexo
Indice
1         lucas     26    M
3       eduarda     22    F
5          jose     60    M

Também podemos chama por linhas ou no caso pelo dado

In [24]:
exemplo_2 = exemplo_info.set_index('nome')
exemplo_2

         idade sexo
nome
lucas       26    M
eduarda     22    F
jose        60    M
maria       56    F

In [25]:
exemplo_2.loc['lucas']

idade    26
sexo      M
Name: lucas, dtype: object

>**Pode ser passados mais de item para loc**  
>**No codigo a baixo só mostrar a coluna que foi informada no segundo 'lista' ou 'paramentos'**
>> ***Lembrando que a primeira lista se refere a linha e a segunda a coluna***
>>> *O indice e sempre mostrado*

In [26]:
exemplo_2.loc[['lucas','maria'],['idade']]

       idade
nome
lucas     26
maria     56

### Com o loc podemos cobinar operações lógicas.

In [48]:
exemplo_2.loc[(exemplo_2['idade']/2)<=26]

         idade sexo
nome
lucas       26    M
eduarda     22    F
jose        60    M
maria       56    F

### Usando Iloc

Diferente do loc o iloc não buscar pelo index, mas lista todos os item do DataFrame de acordo com sua posição como se fosse uma lista python, primeiro indice 0 somando um a cada item .

In [28]:
exemplo_2.iloc[0:4]

         idade sexo
nome
lucas       26    M
eduarda     22    F
jose        60    M
maria       56    F

Mostrando todo DataFrame

In [29]:
exemplo_2.iloc[:]

         idade sexo
nome
lucas       26    M
eduarda     22    F
jose        60    M
maria       56    F

In [30]:
exemplo_2.iloc[-1]

idade    56
sexo      F
Name: maria, dtype: object

> iloc funciona da mesma forma que loc primeiro paramentro linha segundo paramentro coluna

In [52]:
exemplo_2.iloc[0:3,[0,1]] #lambda x: x.index % 2 == 0

         idade sexo
nome
lucas       26    M
eduarda     22    F
jose        60    M

> Definido tipo dos dados da colunas

In [53]:
exemplo_2.idade =exemplo_2.idade.astype('int32')

In [41]:
exemplo_2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, lucas to maria
Data columns (total 2 columns):
idade    4 non-null int32
sexo     4 non-null object
dtypes: int32(1), object(1)
memory usage: 240.0+ bytes